'''
Програма має розраховувати числа послідовності Фібоначчі. Послідовність Фібоначчі -- це послідовність чисел, в якій кожний елемент дорівнює сумі двох попередніх. При цьому нульовий елемент вважається за 0, а перший 1. Отже, сама послідовність виглядає наступним чином:
0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597, 2584, 4181, 6765, 10946, …
Вхідні дані: ціле невід'ємне число n. Передається в програму як аргумент командного рядка.
Результат роботи: значення n-го числа послідовності Фібоначчі.
Будь ласка, не використовуйте рекурсію.
Наприклад
Вхідні дані: 0
Приклад виклику: python lab3_2.py 0
Результат: 0
Вхідні дані: 10
Приклад виклику: python lab3_2.py 10
Результат: 55
'''

import sys

n = 30#int(sys.argv[1])

f1 = 0
f2 = 1

for i in range(n-1):
    f1, f2 = f2, f1 + f2

print f2
